{"ModuleCode": "LL4327V", "LockedModules": [], "History": [{"ExamDate": "2017-11-29T09:00+0800", "Timetable": [{"LessonType": "Seminar-Style Module Class", "StartTime": "0900", "DayText": "Wednesday", "Venue": "SR5-4", "WeekText": "Every Week", "EndTime": "1200", "ClassNo": "1"}], "Semester": 1, "LecturePeriods": ["Wednesday Morning"]}], "ModuleTitle": "Mergers and Acquisitions: A Practitioner’s Perspective", "Prerequisite": "NUS Compulsory Core Law Curriculum or equivalent. Contracts, Property, Equity & Trusts and Company Law. An ability to engage in discussion in English.", "Workload": "0-3-0-0-7", "Preclusion": "(1) LL4327/LL5327/LL6327 Mergers and Acquisitions: A Practitioner’s Perspective; (2) LL4074/LL5074/LL6074; LL4074V/LL5074V/LL6074V Mergers & Acquisitions (M&A); (3) LL4223/LL5223/LL6223; LL4233V/LL5223V/LL6223V Cross Border Mergers", "AcadYear": "2017/2018", "ModuleDescription": "This course will provide a practitioner's perspective on the bread and butter of any transactional practice: mergers and acquisitions (M&A) of non-listed, private companies. It will deal with the structuring of an M&A transaction (the why) and the plain vanilla aspects of documentation (the why and how of basic drafting). Many new graduates seem to be unable to see the wood for the trees. They arrive as trainees, with a reasonable grounding in the law, but an inability to apply it to real life situations. The practicalities elude them and they seem to want to follow templates without much understanding of the transaction. This course will attempt to give them a working knowledge of the issues to be considered in structuring a transaction. It will also cover the main features of standard documentation (bearing in mind that there is a discernible industry-standard set of documentation in common law countries) to explain why documents are drafted the way they are.", "Department": "Law", "ParsedPreclusion": {"and": [{"or": ["LL5327", "LL6327"]}, {"or": ["LL4074", "LL5074", "LL6074"]}, {"or": ["LL4074V", "LL5074V", "LL6074V"]}, {"or": ["LL4223", "LL5223", "LL6223"]}, {"or": ["LL4233V", "LL5223V", "LL6223V"]}]}, "ModmavenTree": {"name": "LL4327V", "children": []}, "ModuleCredit": "5"}