{"ModuleCode": "SG5101", "LockedModules": [], "History": [{"ExamDate": "2017-11-20T18:30+0800", "Timetable": [{"LessonType": "Lecture", "StartTime": "0900", "DayText": "Monday", "Venue": "ISS/2-1", "WeekText": "Every Week", "EndTime": "1100", "ClassNo": "1"}, {"LessonType": "Lecture", "StartTime": "0900", "DayText": "Saturday", "Venue": "ISS/3-5", "WeekText": "Every Week", "EndTime": "1100", "ClassNo": "2"}], "Semester": 1, "LecturePeriods": ["Monday Morning", "Saturday Morning"]}], "ModuleTitle": "Software Analysis & Design", "Prerequisite": "SG4101 BASIC SOFTWARE ENGINEERING DISCIPLINE", "Workload": "3-1-1-9.2-5", "ParsedPrerequisite": "SG4101", "AcadYear": "2017/2018", "ModuleDescription": "SG5101-1 Object-Oriented Requirements & Analysis The objectives of this module are to introduce students to OO development. The OO lifecycle will be illustrated using the Rational Unified Process (RUP). The course describes the RUP OOAD method and how to use the Rational CASE tools; The course also describes the various activities and artifacts created during OO requirements analysis, including creating the user requirement specification, Requirements modeling: and developing the Use Case model, creating the domain object model. The course then goes to describe analysis modeling, including constructing the analysis object model and assigning operations. There will be an OO Requirements and analysis assignment. This module is compulsory for all SE students. SG5101-2 Object Oriented Design & Implementation The objectives of this module are to teach students how to design and implement OO systems. The course will begin by revisiting the OO lifecycle, and concentrating on design and implementation issues. The course will then describe details of design modeling, including construction of the design object model, how to assign attributes; and constructing interaction diagrams; Advanced issues such as interacting with RDBMS, the relationship with Client/Server implementations and distributed computing are also explored. Finally implementing RUP projects, with examples of RUP projects moving into Java are given. There will be an OO implementation assignment. This module is compulsory for all SE students.", "Department": "Institute Of Systems Science", "ModmavenTree": {"name": "SG5101", "children": {"name": "SG4101", "children": []}}, "ModuleCredit": "8"}